 gcc -g p2final.c -lm
îº§ gdb ./a.out
GNU gdb (Ubuntu 8.1.1-0ubuntu1) 8.1.1
Copyright (C) 2018 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from ./a.out...done.
(gdb) b main
Breakpoint 1 at 0x9e1: file p2final.c, line 27.
(gdb) r
Starting program: /home/runner/Test2Session2-3/a.out 
warning: Error disabling address space randomization: Operation not permitted

Breakpoint 1, main () at p2final.c:27
27  {
(gdb) n
30    input_line(&x1,&y1);
(gdb) s
input_line (x1=0x7ffc8b48673c, y1=0x7ffc8b486740) at p2final.c:5
5     printf("enter the point\n");
(gdb) n
enter the point
6     scanf("%f%f",x1,y1);
(gdb) n
4
5
7   }
(gdb) m
Ambiguous command "m": macro, maintenance, make, mem, monitor, mt.
(gdb) n
main () at p2final.c:31
31    input_line(&x2,&y2);
(gdb) n
enter the point
n
32    input_line(&x3,&y3);
(gdb) n
enter the point
n
33    istriangle=is_triangle(x1,y1,x2,y2,x3,y3);
(gdb) n
34    output(x1,y1,x2,y2,x3,y3,istriangle);
(gdb) n
35    return 0;
(gdb) n
36  }
(gdb) c
Continuing.
three lines forms a triangle[Inferior 1 (process 1072) exited normally]
(gdb)
